<?php
/*
|-----------------------------------------------------------------------------------------------------------
| laravel-admin-cms [ 简单高效的开发插件系统 ]
|-----------------------------------------------------------------------------------------------------------
| Licensed ( MIT )
| ----------------------------------------------------------------------------------------------------------
| Copyright (c) 2020-2021 https://gitee.com/liaodeiy/laravel-admin-cms All rights reserved.
| ----------------------------------------------------------------------------------------------------------
| Author: 廖春贵 < liaodeity@gmail.com >
|-----------------------------------------------------------------------------------------------------------
*/

namespace App\Enums;


class UploadDriverEnum extends BaseEnum
{
    const ALIYUN = 'oss';
    const QINIU  = 'kodo';
    protected static $ATTRS = [
        self::ALIYUN => '阿里云OSS',
        self::QINIU  => '七牛云KODO'
    ];
}
