<?php
return [
    /*前台菜单状态*/
    'web_menu_status'     => [
        1 => '显示',
        0 => '隐藏'
    ],
    /*文章状态*/
    'article_status'      => [
        1 => '显示',
        0 => '隐藏'
    ],
    /*分类状态*/
    'category_status'     => [
        1 => '显示',
        0 => '隐藏'
    ],
    /*单页面装填*/
    'page_status'         => [
        1 => '显示',
        0 => '隐藏'
    ],
    /*文章是否置顶*/
    'article_is_top'      => [
        1 => '是',
        0 => '否'
    ],
    /*文章是否推荐*/
    'article_is_relevant' => [
        1 => '是',
        0 => '否'
    ],
    /*用户状态*/
    'user_status'         => [
        1 => '正常',
        2 => '禁用'
    ],
    /*性别*/
    'sex'                 => [
        1 => '男',
        2 => '女',
        0 => '未知'
    ],
    /*友情链接状态*/
    'link_status'         => [
        1 => '显示',
        0 => '不显示'
    ],
    /*菜单打开方式*/
    'web_menu_target'     => [
        '_self'  => '当前标签打开',
        '_blank' => '新标签打开',
    ],
    /*企业所属行业*/
    'join_us_industry'    => [
        1  => '餐饮业',
        2  => '互联网',
        3  => '房地产',
        4  => '服装业',
        5  => '服务行业',
        6  => '健康保健',
        7  => '保险业',
        8  => '建筑业',
        9  => '广告业',
        10 => '邮政快递',
        11 => '政府机关',
        12 => '美容行业',
        13 => '教育培训',
        14 => '零售批发',
        15 => '旅游业',
    ],
    /*申请加入颐老状态*/
    'join_us_status'      => [
        0 => '待处理',
        2 => '处理中',
        1 => '已同意',
        3 => '已拒绝'
    ],
    /*反馈状态*/
    'feedback_status'     => [
        1 => '发布',
        2 => '不发布',
        0 => '待处理',
        4 => '作废'
    ],
    /*日志类型*/
    'log_type'            => [
        1 => '登录',
        2 => '添加',
        3 => '查看',
        4 => '删除',
        5 => '修改',
        6 => '日志',
        7 => '异常',
        8 => '待办'
    ],
    /*分类所属模块*/
    'category_module'     => [
        'article' => '资讯管理',
        'page'    => '单页面管理',
        'link'    => '友情链接'
    ],
    /*分类所属模块*/
    'category_template'   => [
        'news_activity' => '社区活动[图]',
        'partner'       => '惠老企业',
        'health'        => '健康养生',
        'service_axl'   => '慈善爱心铃[单页面]'
    ],
    /*广告位*/
    'ad_type'             => [
        'index' => '首页轮播图',
    ],
    /*广告位状态*/
    'ad_status'           => [
        1 => '显示',
        0 => '不显示'
    ],
    /*回访任务状态*/
    'task_status'         => [
        0  => '未开启',
        2  => '进行中',
        1  => '已完成',
        -1 => '已终止'
    ],
    /*我的回访任务状态*/
    'recall_status'       => [
        0  => '未回访',
        1  => '成功回访',
        2  => '无人接听',
        3  => '继续跟进',
        4  => '数据错误',
        -1 => '任务取消'
    ],
    /*调查表*/
    'survey_status'       => [
        0 => '草稿',
        1 => '使用中',
        2 => '已停用'
    ],
    'survey_item_type'    => [
        1 => '单选',
        2 => '多选',
        3 => '填空'
    ],
    'survey_is_required'  => [
        0 => '非必填',
        1 => '必填'
    ],
    'recall_is_done'      => [
        0 => '否',
        1 => '是'
    ]
];

